[
  {
    "bible_ref": "Genesis 1.1",
    "bom_ref": "2 Ne 2.14",
    "bom_book": "2nephi",
    "bom_chapter": 2,
    "bom_verse": 14,
    "kjv_text": "In the beginning God created the heaven and the earth.",
    "bom_text": "And now, my sons, I speak unto you these things for your profit and learning; for there is a God, and he hath created all things, both the heavens and the earth, and all things that in them are, both things to act and things to be acted upon.",
    "extracted_phrase": "created the heavens and the earth",
    "match_type": "verbal",
    "already_matched": false,
    "notes": ""
  },
  {
    "bible_ref": "Genesis 1.1",
    "bom_ref": "3 Ne 9.15",
    "bom_book": "3nephi",
    "bom_chapter": 9,
    "bom_verse": 15,
    "kjv_text": "In the beginning God created the heaven and the earth.",
    "bom_text": "Behold, I am Jesus Christ the Son of God. I created the heavens and the earth, and all things that in them are. I was with the Father from the beginning. I am in the Father, and the Father in me; and in me hath the Father glorified his name.",
    "extracted_phrase": "created the heavens and the earth",
    "match_type": "verbal",
    "already_matched": false,
    "notes": ""
  },
  {
    "bible_ref": "Genesis 1.1",
    "bom_ref": "Morm 9.11",
    "bom_book": "mormon",
    "bom_chapter": 9,
    "bom_verse": 11,
    "kjv_text": "In the beginning God created the heaven and the earth.",
    "bom_text": "But behold, I will show unto you a God of miracles, even the God of Abraham, and the God of Isaac, and the God of Jacob; and it is that same God who created the heavens and the earth, and all things that in them are.",
    "extracted_phrase": "created the heavens and the earth",
    "match_type": "verbal",
    "already_matched": false,
    "notes": ""
  },
  {
    "bible_ref": "Genesis 1.1, 27",
    "bom_ref": "Mos 7.27",
    "bom_book": "mosiah",
    "bom_chapter": 7,
    "bom_verse": 27,
    "kjv_text": "In the beginning God created the heaven and the earth.",
    "bom_text": "And because he said unto them that Christ was the God, the Father of all things, and said that he should take upon him the image of man, and it should be the image after which man was created in the beginning; or in other words, he said that man was created after the image of God, and that God should come down among the children of men, and take upon him flesh and blood, and go forth upon the face of the earth--",
    "extracted_phrase": "In the beginning",
    "match_type": "verbal",
    "already_matched": false,
    "notes": ""
  },
  {
    "bible_ref": "Genesis 1.1, 27",
    "bom_ref": "Al 18.34",
    "bom_book": "alma",
    "bom_chapter": 18,
    "bom_verse": 34,
    "kjv_text": "In the beginning God created the heaven and the earth.",
    "bom_text": "Ammon said unto him: I am a man; and man in the beginning was created after the image of God, and I am called by his Holy Spirit to teach these things unto this people, that they may be brought to a knowledge of that which is just and true;",
    "extracted_phrase": "In the beginning",
    "match_type": "verbal",
    "already_matched": false,
    "notes": ""
  },
  {
    "bible_ref": "Genesis 1.4",
    "bom_ref": "1 Ne 18.4",
    "bom_book": "1nephi",
    "bom_chapter": 18,
    "bom_verse": 4,
    "kjv_text": "And God saw the light, that it was good: and God divided the light from the darkness.",
    "bom_text": "And it came to pass that after I had finished the ship, according to the word of the Lord, my brethren beheld that it was good, and that the workmanship thereof was exceedingly fine; wherefore, they did humble themselves again before the Lord.",
    "extracted_phrase": null,
    "match_type": "thematic",
    "already_matched": false,
    "notes": "too generic: 'that it was' is common. Thematic echo of divine approval."
  },
  {
    "bible_ref": "Genesis 1.4",
    "bom_ref": "Jac 5.17, 20",
    "bom_book": "jacob",
    "bom_chapter": 5,
    "bom_verse": 17,
    "kjv_text": "And God saw the light, that it was good: and God divided the light from the darkness.",
    "bom_text": "And it came to pass that the Lord of the vineyard looked and beheld the tree in the which the wild olive branches had been grafted; and it had sprung forth and begun to bear fruit. And he beheld that it was good; and the fruit thereof was like unto the natural fruit.",
    "extracted_phrase": null,
    "match_type": "thematic",
    "already_matched": false,
    "notes": "too generic: 'that it was' is common. Thematic echo of divine approval."
  },
  {
    "bible_ref": "Genesis 1.27",
    "bom_ref": "Al 22.12",
    "bom_book": "alma",
    "bom_chapter": 22,
    "bom_verse": 12,
    "kjv_text": "So God created man in his own image, in the image of God created he him; male and female created he them.",
    "bom_text": "And it came to pass that when Aaron saw that the king would believe his words, he began from the creation of Adam, reading the scriptures unto the king--how God created man after his own image, and that God gave him commandments, and that because of transgression, man had fallen.",
    "extracted_phrase": "God created man",
    "match_type": "verbal",
    "already_matched": false,
    "notes": ""
  },
  {
    "bible_ref": "Genesis 1.27",
    "bom_ref": "Eth 3.15",
    "bom_book": "ether",
    "bom_chapter": 3,
    "bom_verse": 15,
    "kjv_text": "So God created man in his own image, in the image of God created he him; male and female created he them.",
    "bom_text": "And never have I showed myself unto man whom I have created, for never has man believed in me as thou hast. Seest thou that ye are created after mine own image? Yea, even all men were created in the beginning after mine own image.",
    "extracted_phrase": "created after mine own image",
    "match_type": "verbal",
    "already_matched": false,
    "notes": "clearly echoes 'in his own image' / 'in the image of God created he him'"
  },
  {
    "bible_ref": "Genesis 2.3",
    "bom_ref": "Moro 4.3",
    "bom_book": "moroni",
    "bom_chapter": 4,
    "bom_verse": 3,
    "kjv_text": "And God blessed the seventh day, and sanctified it: because that in it he had rested from all his work which God created and made.",
    "bom_text": "O God, the Eternal Father, we ask thee in the name of thy Son, Jesus Christ, to bless and sanctify this bread to the souls of all those who partake of it; that they may eat in remembrance of the body of thy Son, and witness unto thee, O God, the Eternal Father, that they are willing to take upon them the name of thy Son, and always remember him, and keep his commandments which he hath given them, that they may always have his Spirit to be with them. Amen.",
    "extracted_phrase": null,
    "match_type": "thematic",
    "already_matched": false,
    "notes": ""
  },
  {
    "bible_ref": "Genesis 2.3",
    "bom_ref": "Moro 5.2",
    "bom_book": "moroni",
    "bom_chapter": 5,
    "bom_verse": 2,
    "kjv_text": "And God blessed the seventh day, and sanctified it: because that in it he had rested from all his work which God created and made.",
    "bom_text": "O God, the Eternal Father, we ask thee, in the name of thy Son, Jesus Christ, to bless and sanctify this wine to the souls of all those who drink of it, that they may do it in remembrance of the blood of thy Son, which was shed for them; that they may witness unto thee, O God, the Eternal Father, that they do always remember him, that they may have his Spirit to be with them. Amen.",
    "extracted_phrase": null,
    "match_type": "thematic",
    "already_matched": false,
    "notes": ""
  },
  {
    "bible_ref": "Genesis 2.7",
    "bom_ref": "Mos 2.25",
    "bom_book": "mosiah",
    "bom_chapter": 2,
    "bom_verse": 25,
    "kjv_text": "And the Lord God formed man of the dust of the ground, and breathed into his nostrils the breath of life; and man became a living soul.",
    "bom_text": "And now I ask, can ye say aught of yourselves? I answer you, Nay. Ye cannot say that ye are even as much as the dust of the earth; yet ye were created of the dust of the earth; but behold, it belongeth to him who created you.",
    "extracted_phrase": "created of the dust of the earth",
    "match_type": "verbal",
    "already_matched": false,
    "notes": ""
  },
  {
    "bible_ref": "Genesis 2.7",
    "bom_ref": "Morm 9.17",
    "bom_book": "mormon",
    "bom_chapter": 9,
    "bom_verse": 17,
    "kjv_text": "And the Lord God formed man of the dust of the ground, and breathed into his nostrils the breath of life; and man became a living soul.",
    "bom_text": "Who shall say that it was not a miracle that by his word the heaven and the earth should be; and by the power of his word man was created of the dust of the earth; and by the power of his word have miracles been wrought?",
    "extracted_phrase": "created of the dust of the earth",
    "match_type": "verbal",
    "already_matched": false,
    "notes": ""
  },
  {
    "bible_ref": "Genesis 2.19",
    "bom_ref": "2 Ne 2.15",
    "bom_book": "2nephi",
    "bom_chapter": 2,
    "bom_verse": 15,
    "kjv_text": "And out of the ground the Lord God formed every beast of the field, and every fowl of the air; and brought them unto Adam to see what he would call them: and whatsoever Adam called every living creature, that was the name thereof.",
    "bom_text": "And to bring about his eternal purposes in the end of man, after he had created our first parents, and the beasts of the field and the fowls of the air, and in fine, all things which are created, it must needs be that there was an opposition; even the forbidden fruit in opposition to the tree of life; the one being sweet and the other bitter.",
    "extracted_phrase": "the beasts of the field and the fowls of the air",
    "match_type": "verbal",
    "already_matched": false,
    "notes": "nearly verbatim echo"
  },
  {
    "bible_ref": "Genesis 3.5",
    "bom_ref": "Al 12.31",
    "bom_book": "alma",
    "bom_chapter": 12,
    "bom_verse": 31,
    "kjv_text": "For God doth know that in the day ye eat thereof, then your eyes shall be opened, and ye shall be as gods, knowing good and evil.",
    "bom_text": "Wherefore, he gave commandments unto men, they having first transgressed the first commandments as to things which were temporal, and becoming as gods, knowing good from evil, placing themselves in a state to act, or being placed in a state to act according to their wills and pleasures, whether to do evil or to do good--",
    "extracted_phrase": "as gods, knowing good from evil",
    "match_type": "verbal",
    "already_matched": false,
    "notes": ""
  },
  {
    "bible_ref": "Genesis 3.5, 13",
    "bom_ref": "Mos 16.3",
    "bom_book": "mosiah",
    "bom_chapter": 16,
    "bom_verse": 3,
    "kjv_text": "For God doth know that in the day ye eat thereof, then your eyes shall be opened, and ye shall be as gods, knowing good and evil.",
    "bom_text": "For they are carnal and devilish, and the devil has power over them; yea, even that old serpent that did beguile our first parents, which was the cause of their fall; which was the cause of all mankind becoming carnal, sensual, devilish, knowing evil from good, subjecting themselves to the devil.",
    "extracted_phrase": "that old serpent that did beguile",
    "match_type": "verbal",
    "already_matched": false,
    "notes": "echoes serpent/beguile language from Genesis 3.5, 13"
  },
  {
    "bible_ref": "Genesis 3.6",
    "bom_ref": "1 Ne 8.10",
    "bom_book": "1nephi",
    "bom_chapter": 8,
    "bom_verse": 10,
    "kjv_text": "And when the woman saw that the tree was good for food, and that it was pleasant to the eyes, and a tree to be desired to make one wise, she took of the fruit thereof, and did eat, and gave also unto her husband with her; and he did eat.",
    "bom_text": "And it came to pass that I beheld a tree, whose fruit was desirable to make one happy.",
    "extracted_phrase": "desirable to make one",
    "match_type": "verbal",
    "already_matched": false,
    "notes": "echoes 'desired to make one wise' from KJV"
  },
  {
    "bible_ref": "Genesis 3.17",
    "bom_ref": "1 Ne 17.38",
    "bom_book": "1nephi",
    "bom_chapter": 17,
    "bom_verse": 38,
    "kjv_text": "And unto Adam he said, Because thou hast hearkened unto the voice of thy wife, and hast eaten of the tree, of which I commanded thee, saying, Thou shalt not eat of it: cursed is the ground for thy sake; in sorrow shalt thou eat of it all the days of thy life;",
    "bom_text": "And he leadeth away the righteous into precious lands, and the wicked he destroyeth, and curseth the land unto them for their sakes.",
    "extracted_phrase": null,
    "match_type": "thematic",
    "already_matched": false,
    "notes": ""
  },
  {
    "bible_ref": "Genesis 3.17",
    "bom_ref": "2 Ne 1.7",
    "bom_book": "2nephi",
    "bom_chapter": 1,
    "bom_verse": 7,
    "kjv_text": "And unto Adam he said, Because thou hast hearkened unto the voice of thy wife, and hast eaten of the tree, of which I commanded thee, saying, Thou shalt not eat of it: cursed is the ground for thy sake; in sorrow shalt thou eat of it all the days of thy life;",
    "bom_text": "Wherefore, this land is consecrated unto him whom he shall bring. And if it so be that they shall serve him according to the commandments which he hath given, it shall be a land of liberty unto them; wherefore, they shall never be brought down into captivity; if so, it shall be because of iniquity; for if iniquity shall abound cursed shall be the land for their sakes, but unto the righteous it shall be blessed forever.",
    "extracted_phrase": "cursed shall be the land for their sakes",
    "match_type": "verbal",
    "already_matched": false,
    "notes": "echoes 'cursed is the ground for thy sake'"
  },
  {
    "bible_ref": "Genesis 3.17",
    "bom_ref": "Jac 2.29",
    "bom_book": "jacob",
    "bom_chapter": 2,
    "bom_verse": 29,
    "kjv_text": "And unto Adam he said, Because thou hast hearkened unto the voice of thy wife, and hast eaten of the tree, of which I commanded thee, saying, Thou shalt not eat of it: cursed is the ground for thy sake; in sorrow shalt thou eat of it all the days of thy life;",
    "bom_text": "Wherefore, this people shall keep my commandments, saith the Lord of Hosts, or cursed be the land for their sakes.",
    "extracted_phrase": "cursed be the land for their sakes",
    "match_type": "verbal",
    "already_matched": false,
    "notes": "echoes 'cursed is the ground for thy sake'"
  },
  {
    "bible_ref": "Genesis 3.17",
    "bom_ref": "Jac 3.3",
    "bom_book": "jacob",
    "bom_chapter": 3,
    "bom_verse": 3,
    "kjv_text": "And unto Adam he said, Because thou hast hearkened unto the voice of thy wife, and hast eaten of the tree, of which I commanded thee, saying, Thou shalt not eat of it: cursed is the ground for thy sake; in sorrow shalt thou eat of it all the days of thy life;",
    "bom_text": "But, wo, wo, unto you that are not pure in heart, that are filthy this day before God; for except ye repent the land is cursed for your sakes; and the Lamanites, which are not filthy like unto you, nevertheless they are cursed with a sore cursing, shall scourge you even unto destruction.",
    "extracted_phrase": "the land is cursed for your sakes",
    "match_type": "verbal",
    "already_matched": false,
    "notes": "echoes 'cursed is the ground for thy sake'"
  },
  {
    "bible_ref": "Genesis 3.17",
    "bom_ref": "Morm 1.17",
    "bom_book": "mormon",
    "bom_chapter": 1,
    "bom_verse": 17,
    "kjv_text": "And unto Adam he said, Because thou hast hearkened unto the voice of thy wife, and hast eaten of the tree, of which I commanded thee, saying, Thou shalt not eat of it: cursed is the ground for thy sake; in sorrow shalt thou eat of it all the days of thy life;",
    "bom_text": "But I did remain among them, but I was forbidden to preach unto them, because of the hardness of their hearts; and because of the hardness of their hearts the land was cursed for their sake.",
    "extracted_phrase": "the land was cursed for their sake",
    "match_type": "verbal",
    "already_matched": false,
    "notes": "echoes 'cursed is the ground for thy sake'"
  },
  {
    "bible_ref": "Genesis 3.23-24",
    "bom_ref": "2 Ne 2.19",
    "bom_book": "2nephi",
    "bom_chapter": 2,
    "bom_verse": 19,
    "kjv_text": "Therefore the Lord God sent him forth from the garden of Eden, to till the ground from whence he was taken.",
    "bom_text": "And after Adam and Eve had partaken of the forbidden fruit they were driven out of the garden of Eden, to till the earth.",
    "extracted_phrase": "driven out of the garden of Eden, to till the earth",
    "match_type": "verbal",
    "already_matched": false,
    "notes": "echoes 'sent him forth from the garden of Eden, to till the ground'"
  },
  {
    "bible_ref": "Genesis 4.10",
    "bom_ref": "2 Ne 26.3",
    "bom_book": "2nephi",
    "bom_chapter": 26,
    "bom_verse": 3,
    "kjv_text": "And he said, What hast thou done? the voice of thy brother's blood crieth unto me from the ground.",
    "bom_text": "And after the Messiah shall come there shall be signs given unto my people of his birth, and also of his death and resurrection; and great and terrible shall that day be unto the wicked, for they shall perish; and they perish because they cast out the prophets, and the saints, and stone them, and slay them; wherefore the cry of the blood of the saints shall ascend up to God from the ground against them.",
    "extracted_phrase": "the cry of the blood of the saints shall ascend up to God from the ground",
    "match_type": "verbal",
    "already_matched": false,
    "notes": "echoes blood crying from ground"
  },
  {
    "bible_ref": "Genesis 4.10",
    "bom_ref": "2 Ne 28.10",
    "bom_book": "2nephi",
    "bom_chapter": 28,
    "bom_verse": 10,
    "kjv_text": "And he said, What hast thou done? the voice of thy brother's blood crieth unto me from the ground.",
    "bom_text": "And the blood of the saints shall cry from the ground against them.",
    "extracted_phrase": "the blood of the saints shall cry from the ground",
    "match_type": "verbal",
    "already_matched": false,
    "notes": "near-verbatim echo"
  },
  {
    "bible_ref": "Genesis 4.10",
    "bom_ref": "Al 20.18",
    "bom_book": "alma",
    "bom_chapter": 20,
    "bom_verse": 18,
    "kjv_text": "And he said, What hast thou done? the voice of thy brother's blood crieth unto me from the ground.",
    "bom_text": "And again, it is expedient that thou shouldst forbear; for if thou shouldst slay thy son, he being an innocent man, his blood would cry from the ground to the Lord his God, for vengeance to come upon thee; and perhaps thou wouldst lose thy soul.",
    "extracted_phrase": "his blood would cry from the ground",
    "match_type": "verbal",
    "already_matched": false,
    "notes": "echoes blood crying from ground"
  },
  {
    "bible_ref": "Genesis 4.10",
    "bom_ref": "3 Ne 9.11",
    "bom_book": "3nephi",
    "bom_chapter": 9,
    "bom_verse": 11,
    "kjv_text": "And he said, What hast thou done? the voice of thy brother's blood crieth unto me from the ground.",
    "bom_text": "And because they did cast them all out, that there were none righteous among them, I did send down fire and destroy them, that their wickedness and abominations might be hid from before my face, that the blood of the prophets and the saints whom I sent among them might not cry unto me from the ground against them.",
    "extracted_phrase": "the blood of the prophets and the saints...might cry unto me from the ground",
    "match_type": "verbal",
    "already_matched": false,
    "notes": "echoes blood crying from ground"
  },
  {
    "bible_ref": "Genesis 4.10",
    "bom_ref": "Morm 8.40",
    "bom_book": "mormon",
    "bom_chapter": 8,
    "bom_verse": 40,
    "kjv_text": "And he said, What hast thou done? the voice of thy brother's blood crieth unto me from the ground.",
    "bom_text": "Yea, why do ye build up your secret abominations to get gain, and cause that widows should mourn before the Lord, and also orphans to mourn before the Lord, and also the blood of their fathers and their husbands to cry unto the Lord from the ground, for vengeance upon your heads?",
    "extracted_phrase": "to cry unto the Lord from the ground",
    "match_type": "verbal",
    "already_matched": false,
    "notes": "echoes blood crying from ground"
  },
  {
    "bible_ref": "Genesis 4.10",
    "bom_ref": "Eth 8.22, 24",
    "bom_book": "ether",
    "bom_chapter": 8,
    "bom_verse": 22,
    "kjv_text": "And he said, What hast thou done? the voice of thy brother's blood crieth unto me from the ground.",
    "bom_text": "And whatsoever nation shall uphold such secret combinations, to get power and gain, until they shall spread over the nation, behold, they shall be destroyed; for the Lord will not suffer that the blood of his saints, which shall be shed by them, shall always cry unto him from the ground for vengeance upon them and yet he avenge them not.",
    "extracted_phrase": "cry unto him from the ground",
    "match_type": "verbal",
    "already_matched": false,
    "notes": "echoes blood crying from ground"
  },
  {
    "bible_ref": "Genesis 4.11, 15",
    "bom_ref": "Al 3.7",
    "bom_book": "alma",
    "bom_chapter": 3,
    "bom_verse": 7,
    "kjv_text": "And now art thou cursed from the earth, which hath opened her mouth to receive thy brother's blood from thy hand;",
    "bom_text": "And their brethren sought to destroy them, therefore they were cursed; and the Lord God set a mark upon them, yea, upon Laman and Lemuel, and also the sons of Ishmael, and Ishmaelitish women.",
    "extracted_phrase": null,
    "match_type": "thematic",
    "already_matched": false,
    "notes": ""
  },
  {
    "bible_ref": "Genesis 6.3",
    "bom_ref": "1 Ne 7.14",
    "bom_book": "1nephi",
    "bom_chapter": 7,
    "bom_verse": 14,
    "kjv_text": "And the Lord said, My spirit shall not always strive with man, for that he also is flesh: yet his days shall be an hundred and twenty years.",
    "bom_text": "For behold, the Spirit of the Lord ceaseth soon to strive with them; for behold, they have rejected the prophets, and Jeremiah have they cast into prison. And they have sought to take away the life of my father, insomuch that they have driven him out of the land.",
    "extracted_phrase": "the Spirit of the Lord ceaseth soon to strive with them",
    "match_type": "verbal",
    "already_matched": false,
    "notes": "echoes 'My spirit shall not always strive with man'"
  },
  {
    "bible_ref": "Genesis 6.3",
    "bom_ref": "Morm 5.16",
    "bom_book": "mormon",
    "bom_chapter": 5,
    "bom_verse": 16,
    "kjv_text": "And the Lord said, My spirit shall not always strive with man, for that he also is flesh: yet his days shall be an hundred and twenty years.",
    "bom_text": "For behold, the Spirit of the Lord hath already ceased to strive with their fathers; and they are without Christ and God in the world; and they are driven about as chaff before the wind.",
    "extracted_phrase": "the Spirit of the Lord hath already ceased to strive with",
    "match_type": "verbal",
    "already_matched": false,
    "notes": "echoes 'My spirit shall not always strive with man'"
  },
  {
    "bible_ref": "Genesis 6.3",
    "bom_ref": "Eth 2.15",
    "bom_book": "ether",
    "bom_chapter": 2,
    "bom_verse": 15,
    "kjv_text": "And the Lord said, My spirit shall not always strive with man, for that he also is flesh: yet his days shall be an hundred and twenty years.",
    "bom_text": "And the brother of Jared repented of the evil which he had done, and did call upon the name of the Lord for his brethren who were with him. And the Lord said unto him: I will forgive thee and thy brethren of their sins; but thou shalt not sin any more, for ye shall remember that my Spirit will not always strive with man; wherefore, if ye will sin until ye are fully ripe ye shall be cut off from the presence of the Lord. And these are my thoughts upon the land which I shall give you for your inheritance; for it shall be a land choice above all other lands.",
    "extracted_phrase": "my Spirit will not always strive with man",
    "match_type": "verbal",
    "already_matched": false,
    "notes": "near-verbatim echo"
  },
  {
    "bible_ref": "Genesis 6.3",
    "bom_ref": "Moro 8.28",
    "bom_book": "moroni",
    "bom_chapter": 8,
    "bom_verse": 28,
    "kjv_text": "And the Lord said, My spirit shall not always strive with man, for that he also is flesh: yet his days shall be an hundred and twenty years.",
    "bom_text": "Pray for them, my son, that repentance may come unto them. But behold, I fear lest the Spirit hath ceased striving with them; and in this part of the land they are also seeking to put down all power and authority which cometh from God; and they are denying the Holy Ghost.",
    "extracted_phrase": "the Spirit hath ceased striving with them",
    "match_type": "verbal",
    "already_matched": false,
    "notes": "echoes 'My spirit shall not always strive with man'"
  },
  {
    "bible_ref": "Genesis 6.3",
    "bom_ref": "Moro 9.4",
    "bom_book": "moroni",
    "bom_chapter": 9,
    "bom_verse": 4,
    "kjv_text": "And the Lord said, My spirit shall not always strive with man, for that he also is flesh: yet his days shall be an hundred and twenty years.",
    "bom_text": "Behold, I am laboring with them continually; and when I speak the word of God with sharpness they tremble and anger against me; and when I use no sharpness they harden their hearts against it; wherefore, I fear lest the Spirit of the Lord hath ceased striving with them.",
    "extracted_phrase": "the Spirit of the Lord hath ceased striving with them",
    "match_type": "verbal",
    "already_matched": false,
    "notes": "echoes 'My spirit shall not always strive with man'"
  },
  {
    "bible_ref": "Genesis 6.5",
    "bom_ref": "Hel 15.4",
    "bom_book": "helaman",
    "bom_chapter": 15,
    "bom_verse": 4,
    "kjv_text": "And God saw that the wickedness of man was great in the earth, and that every imagination of the thoughts of his heart was only evil continually.",
    "bom_text": "But behold my brethren, the Lamanites hath he hated because their deeds have been evil continually, and this because of the iniquity of the tradition of their fathers. But behold, salvation hath come unto them through the preaching of the Nephites; and for this intent hath the Lord prolonged their days.",
    "extracted_phrase": null,
    "match_type": "thematic",
    "already_matched": false,
    "notes": "echo: 'evil continually' (only 2 words, too short for verbal match)"
  },
  {
    "bible_ref": "Genesis 6.5",
    "bom_ref": "Eth 3.2",
    "bom_book": "ether",
    "bom_chapter": 3,
    "bom_verse": 2,
    "kjv_text": "And God saw that the wickedness of man was great in the earth, and that every imagination of the thoughts of his heart was only evil continually.",
    "bom_text": "O Lord, thou hast said that we must be encompassed about by the floods. Now behold, O Lord, and do not be angry with thy servant because of his weakness before thee; for we know that thou art holy and dwellest in the heavens, and that we are unworthy before thee; because of the fall our natures have become evil continually; nevertheless, O Lord, thou hast given us a commandment that we must call upon thee, that from thee we may receive according to our desires.",
    "extracted_phrase": null,
    "match_type": "thematic",
    "already_matched": false,
    "notes": "echo: 'evil continually' (only 2 words, too short for verbal match)"
  },
  {
    "bible_ref": "Genesis 6.5",
    "bom_ref": "Moro 7.12",
    "bom_book": "moroni",
    "bom_chapter": 7,
    "bom_verse": 12,
    "kjv_text": "And God saw that the wickedness of man was great in the earth, and that every imagination of the thoughts of his heart was only evil continually.",
    "bom_text": "Wherefore, all things which are good cometh of God; and that which is evil cometh of the devil; for the devil is an enemy unto God, and fighteth against him continually, and inviteth and enticeth to sin, and to do that which is evil continually.",
    "extracted_phrase": null,
    "match_type": "thematic",
    "already_matched": false,
    "notes": "echo: 'evil continually' (only 2 words, too short for verbal match)"
  },
  {
    "bible_ref": "Genesis 10.9",
    "bom_ref": "Eth 2.1",
    "bom_book": "ether",
    "bom_chapter": 2,
    "bom_verse": 1,
    "kjv_text": "He was a mighty hunter before the Lord: wherefore it is said, Even as Nimrod the mighty hunter before the Lord.",
    "bom_text": "And it came to pass that Jared and his brother, and their families, and also the friends of Jared and his brother and their families, went down into the valley which was northward, (and the name of the valley was Nimrod, being called after the mighty hunter) with their flocks which they had gathered together, male and female, of every kind.",
    "extracted_phrase": "the mighty hunter",
    "match_type": "verbal",
    "already_matched": false,
    "notes": ""
  },
  {
    "bible_ref": "Genesis 11.4",
    "bom_ref": "Hel 6.28",
    "bom_book": "helaman",
    "bom_chapter": 6,
    "bom_verse": 28,
    "kjv_text": "And they said, Go to, let us build us a city and a tower, whose top may reach unto heaven; and let us make us a name, lest we be scattered abroad upon the face of the whole earth.",
    "bom_text": "And also it is that same being who put it into the hearts of the people to build a tower sufficiently high that they might get to heaven. And it was that same being who led on the people who came from that tower into this land; who spread the works of darkness and abominations over all the face of the land, until he dragged the people down to an entire destruction, and to an everlasting hell.",
    "extracted_phrase": "the face of the",
    "match_type": "verbal",
    "already_matched": false,
    "notes": ""
  },
  {
    "bible_ref": "Genesis 11.4-8",
    "bom_ref": "Omni 1.22",
    "bom_book": "omni",
    "bom_chapter": 1,
    "bom_verse": 22,
    "kjv_text": "And they said, Go to, let us build us a city and a tower, whose top may reach unto heaven; and let us make us a name, lest we be scattered abroad upon the face of the whole earth.",
    "bom_text": "It also spake a few words concerning his fathers. And his first parents came out from the tower, at the time the Lord confounded the language of the people; and the severity of the Lord fell upon them according to his judgments, which are just; and their bones lay scattered in the land northward.",
    "extracted_phrase": "the Lord confounded the language of the people",
    "match_type": "verbal",
    "already_matched": false,
    "notes": "echoes Genesis 11 language confusion narrative"
  },
  {
    "bible_ref": "Genesis 11.4-8",
    "bom_ref": "Mos 28.17",
    "bom_book": "mosiah",
    "bom_chapter": 28,
    "bom_verse": 17,
    "kjv_text": "And they said, Go to, let us build us a city and a tower, whose top may reach unto heaven; and let us make us a name, lest we be scattered abroad upon the face of the whole earth.",
    "bom_text": "Now after Mosiah had finished translating these records, behold, it gave an account of the people who were destroyed, from the time that they were destroyed back to the building of the great tower, at the time the Lord confounded the language of the people and they were scattered abroad upon the face of all the earth, yea, and even from that time back until the creation of Adam.",
    "extracted_phrase": "scattered abroad upon the face of all the earth",
    "match_type": "verbal",
    "already_matched": false,
    "notes": ""
  },
  {
    "bible_ref": "Genesis 11.4-8",
    "bom_ref": "Eth 1.33, 35, 36",
    "bom_book": "ether",
    "bom_chapter": 1,
    "bom_verse": 33,
    "kjv_text": "And they said, Go to, let us build us a city and a tower, whose top may reach unto heaven; and let us make us a name, lest we be scattered abroad upon the face of the whole earth.",
    "bom_text": "Which Jared came forth with his brother and their families, with some others and their families, from the great tower, at the time the Lord confounded the language of the people, and swore in his wrath that they should be scattered upon all the face of the earth; and according to the word of the Lord the people were scattered.",
    "extracted_phrase": "the face of the",
    "match_type": "verbal",
    "already_matched": false,
    "notes": ""
  },
  {
    "bible_ref": "Genesis 11.8",
    "bom_ref": "Mos 27.6",
    "bom_book": "mosiah",
    "bom_chapter": 27,
    "bom_verse": 6,
    "kjv_text": "So the Lord scattered them abroad from thence upon the face of all the earth: and they left off to build the city.",
    "bom_text": "And there began to be much peace again in the land; and the people began to be very numerous, and began to scatter abroad upon the face of the earth, yea, on the north and on the south, on the east and on the west, building large cities and villages in all quarters of the land.",
    "extracted_phrase": "upon the face of",
    "match_type": "verbal",
    "already_matched": false,
    "notes": ""
  },
  {
    "bible_ref": "Genesis 12.2",
    "bom_ref": "Eth 1.42-43",
    "bom_book": "ether",
    "bom_chapter": 1,
    "bom_verse": 42,
    "kjv_text": "And I will make of thee a great nation, and I will bless thee, and make thy name great; and thou shalt be a blessing:",
    "bom_text": "And when thou hast done this thou shalt go at the head of them down into the valley which is northward. And there will I meet thee, and I will go before thee into a land which is choice above all the lands of the earth.",
    "extracted_phrase": null,
    "match_type": "thematic",
    "already_matched": false,
    "notes": "too generic: 'And I will' is common. Thematic echo of divine promise and covenant."
  },
  {
    "bible_ref": "Genesis 14.18-20",
    "bom_ref": "Al 13.14-19",
    "bom_book": "alma",
    "bom_chapter": 13,
    "bom_verse": 14,
    "kjv_text": "And Melchizedek king of Salem brought forth bread and wine: and he was the priest of the most high God.",
    "bom_text": "Yea, humble yourselves even as the people in the days of Melchizedek, who was also a high priest after this same order which I have spoken, who also took upon him the high priesthood forever.",
    "extracted_phrase": null,
    "match_type": "thematic",
    "already_matched": false,
    "notes": ""
  },
  {
    "bible_ref": "Genesis 14.20",
    "bom_ref": "3 Ne 4.32-33",
    "bom_book": "3nephi",
    "bom_chapter": 4,
    "bom_verse": 32,
    "kjv_text": "And blessed be the most high God, which hath delivered thine enemies into thy hand. And he gave him tithes of all.",
    "bom_text": "Yea, they did cry: Hosanna to the Most High God. And they did cry: Blessed be the name of the Lord God Almighty, the Most High God.",
    "extracted_phrase": "Blessed be...the Most High God",
    "match_type": "verbal",
    "already_matched": false,
    "notes": "echoes 'blessed be the most high God'"
  },
  {
    "bible_ref": "Genesis 15.6",
    "bom_ref": "Moro 7.7",
    "bom_book": "moroni",
    "bom_chapter": 7,
    "bom_verse": 7,
    "kjv_text": "And he believed in the Lord; and he counted it to him for righteousness.",
    "bom_text": "For behold, it is not counted unto him for righteousness.",
    "extracted_phrase": "counted unto him for righteousness",
    "match_type": "verbal",
    "already_matched": false,
    "notes": "includes the key verb 'counted'"
  },
  {
    "bible_ref": "Genesis 15.13, 16",
    "bom_ref": "Al 45.10, 12",
    "bom_book": "alma",
    "bom_chapter": 45,
    "bom_verse": 10,
    "kjv_text": "And he said unto Abram, Know of a surety that thy seed shall be a stranger in a land that is not theirs, and shall serve them; and they shall afflict them four hundred years;",
    "bom_text": "And these are the words: Behold, I perceive that this very people, the Nephites, according to the spirit of revelation which is in me, in four hundred years from the time that Jesus Christ shall manifest himself unto them, shall dwindle in unbelief.",
    "extracted_phrase": null,
    "match_type": "thematic",
    "already_matched": false,
    "notes": ""
  }
]